SPedt/src/Documents/СинхронизацияСправочников/СинхронизацияСправочников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СинхронизацияСправочников</name>
  <registerRecords>AccumulationRegister.Обмен100СПрн_Ошибки</registerRecords>
  <attributes>
    <name>ОшибкаРазбораXML</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПараметрыЗагрузки</name>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>xmlName</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НачалоЗагрузки</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ПолученоЭлементов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НачалоД</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>КонецД</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Ошибок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПараметрыОтдельныеЗапросы</name>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>xmlName</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НачалоЗагрузки</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ПолученоЭлементов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НачалоД</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>КонецД</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Ошибок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

SPedt/src/Enums/ТипыОбменов100сп/ТипыОбменов100сп.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыОбменов100сп</name>
  <enumValues>
    <name>Приход</name>
  </enumValues>
  <enumValues>
    <name>Возврат</name>
  </enumValues>
  <enumValues>
    <name>ПередачаВозврата</name>
  </enumValues>
  <enumValues>
    <name>ПеремещениеВозврата</name>
  </enumValues>
  <enumValues>
    <name>Расход</name>
  </enumValues>
  <enumValues>
    <name>Карты</name>
  </enumValues>
  <enumValues>
    <name>Транзит</name>
  </enumValues>
  <enumValues>
    <name>СуперГруппа</name>
  </enumValues>
  <enumValues>
    <name>СуперГруппаРегистрация</name>
  </enumValues>
  <enumValues>
    <name>СуперГруппаКолено</name>
  </enumValues>
  <enumValues>
    <name>ЗагрузкаПосылок</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеПристроя</name>
  </enumValues>
  <enumValues>
    <name>ВыгрузкаЯндекс</name>
  </enumValues>
  <enumValues>
    <name>КурьерскаяДоставка</name>
  </enumValues>
  <enumValues>
    <name>ГруппыДоставкиЗапросОплаты</name>
  </enumValues>
  <enumValues>
    <name>ГруппыДоставкиЗапросОтсрочки</name>
  </enumValues>
  <enumValues>
    <name>ПотерянныеЗаказы</name>
  </enumValues>
  <enumValues>
    <name>ЗагрузкаСправочников</name>
  </enumValues>
  <enumValues>
    <name>Списание</name>
  </enumValues>
</mdclass:Enum>

SPedt/src/Documents/СинхронизацияСправочников/ManagerModule.bsl
#Область Проведение

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства, Регистры = Неопределено) Экспорт
	
	////////////////////////////////////////////////////////////////////////////
	// Создадим запрос инициализации движений
	
	Запрос = Новый Запрос;
	ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка);
	////////////////////////////////////////////////////////////////////////////
	// Сформируем текст запроса
	ТекстыЗапроса = Новый СписокЗначений;

	Получить_ТекстЗапроса_Обмен100СПрн_Ошибки (Запрос, ТекстыЗапроса, Регистры);

	ПроведениеСервер.ИницализироватьТаблицыДляДвижений(Запрос, ТекстыЗапроса, ДополнительныеСвойства.ТаблицыДляДвижений, Истина);
	
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка)
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	Запрос.УстановитьПараметр("Период",                        ДокументСсылка.Дата );
	Запрос.УстановитьПараметр("Номер",                         ДокументСсылка.Номер);
	Запрос.УстановитьПараметр("ИдентификаторМетаданных",       ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ПолноеИмяОбъекта()));
	Запрос.УстановитьПараметр("ПометкаУдаления",               ДокументСсылка.ПометкаУдаления);
	Запрос.УстановитьПараметр("Проведен",                      ДокументСсылка.Проведен); 
	Запрос.УстановитьПараметр("гпНеПринимать",                 Константы.гпНеПринимать.Получить());
	Запрос.УстановитьПараметр("СвойПунктВыдачи",               Константы.СвояТочка.Получить()); 
	Запрос.УстановитьПараметр("ВозможностьИспользоватьТранзит",Константы.ВозможностьПриниматьНаТранзит.Получить());
	Запрос.УстановитьПараметр("Курьер100сп",				   Константы.ПунктВыдачиКурьерскойДоставки.Получить());
	Запрос.УстановитьПараметр("ИгнорироватьОшибкуИзмененияПунктаНазначения",				   Константы.ИгнорироватьОшибкуИзмененияПунктаНазначения.Получить());
	
КонецПроцедуры

#КонецОбласти


Функция Получить_ТекстЗапроса_Обмен100СПрн_Ошибки (Запрос, ТекстыЗапроса, Регистры)
	ИмяРегистра = "Обмен100СПрн_Ошибки";
	Если НЕ ПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли; 

	
	ТекстЗапроса =  "
					|
					|ВЫБРАТЬ
	                |	СинхронизацияСправочников.Ссылка.Дата КАК Период,
	                |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	                |	ЗНАЧЕНИЕ(Перечисление.ТипыОбменов100сп.ЗагрузкаСправочников) КАК типОбмена,
	                |	СинхронизацияСправочников.Ссылка КАК Партия,
	                |	0 КАК СтрокаВПартии,
	                |	Значение(Справочник.Мегаордера.ПустаяСсылка) КАК Мегаордер,
	                |	""Ошибка разбора xml!"" КАК СообщениеОшибки,
	                |	1 КАК КоличествоНеИсправленных
	                |ИЗ
	                |	Документ.СинхронизацияСправочников  КАК СинхронизацияСправочников
	                |ГДЕ
	                |	СинхронизацияСправочников.Ссылка = &Ссылка
	                |	И  СинхронизацияСправочников.ОшибкаРазбораXML
	                |
	                |ОБЪЕДИНИТЬ ВСЕ
	                |
	                |ВЫБРАТЬ
	                |	ПараметрыЗагрузки.Ссылка.Дата,
	                |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	                |	ЗНАЧЕНИЕ(Перечисление.ТипыОбменов100сп.ЗагрузкаСправочников),
	                |	ПараметрыЗагрузки.Ссылка,
	                |	ПараметрыЗагрузки.НомерСтроки,
	                |	Значение(Справочник.Мегаордера.ПустаяСсылка),
	                |	ПараметрыЗагрузки.Наименование,
	                |	ПараметрыЗагрузки.Ошибок
	                |ИЗ
	                |	Документ.СинхронизацияСправочников.ПараметрыЗагрузки КАК ПараметрыЗагрузки
	                |ГДЕ
	                |	ПараметрыЗагрузки.Ссылка = &Ссылка
	                |	И ПараметрыЗагрузки.Ошибок>0";
	
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;
КонецФункции


Функция ПолноеИмяОбъекта()
	Возврат "Документ.СинхронизацияСправочников";
КонецФункции
